building/load.yml
config:
  target: "https://example.com"
  phases:
    # Ramp-Up Phase: Start with small traffic and gradually increase.
    - duration: 600              # 10 minutes ramp-up phase
      arrivalRate: 10            # Start with 10 users/sec
      rampTo: 100               # Ramp up to 100 users/sec by the end of the phase

    # Steady Load Phase: Simulate a steady load of 500 users/sec for 30 minutes.
    - duration: 1800             # 30 minutes of steady load
      arrivalRate: 100           # Sustained 100 users/sec, simulating 500 concurrent users

    # Peak Load Phase: Simulate a peak load of 500 users/sec for 10 minutes.
    - duration: 600              # 10 minutes of peak load
      arrivalRate: 500           # Ramp up to 500 users/sec

    # Ramp-Down Phase: Reduce load gradually.
    - duration: 600              # 10 minutes ramp-down
      arrivalRate: 50            # Reduce to 50 users/sec

  tls:
    rejectUnauthorized: false

scenarios:
  - name: "Building Load Test on /"
    flow:
      - get:
          url: "/"
          expect:
            - statusCode: 200
          think: 1  # Think time between requests to simulate user behavior