building/stress.yml
config:
  target: "https://example.com"
  phases:
    # Ramp-Up Phase: Gradually increase traffic to simulate user buildup.
    - duration: 600              # 10 minutes ramp-up
      arrivalRate: 10            # Start with 10 users/sec
      rampTo: 200               # Ramp to 200 users/sec over 10 minutes

    # Peak Load Phase: Simulate high traffic for 10 minutes at 1000 users/sec
    - duration: 600              # 10 minutes of peak load
      arrivalRate: 1000          # 1000 users/sec for 10 minutes (stress)

    # Sudden Spike Phase: Simulate an extreme spike for 5 minutes.
    - duration: 300              # 5 minutes of intense stress
      arrivalRate: 2000          # Spike to 2000 users/sec

    # Ramp-Down Phase: Gradually reduce load to normal.
    - duration: 300              # 5 minutes ramp-down
      arrivalRate: 50            # Reduce to 50 users/sec over the last phase

  tls:
    rejectUnauthorized: false

scenarios:
  - name: "Building Stress Test on /"
    flow:
      - get:
          url: "/"
          expect:
            - statusCode: 200
          think: 1  # Think time to simulate real user behavior